export function useInitData(){
    return {
        // 点集
        nodes: [
            // {
            //     id: 'node1', // String，该节点存在则必须，节点的唯一标识
            //     label: '11111',
            //     x: 100, // Number，可选，节点位置的 x 值
            //     y: 200, // Number，可选，节点位置的 y 值
            // },
            // {
            //     id: 'node2', // String，该节点存在则必须，节点的唯一标识
            //     x: 300, // Number，可选，节点位置的 x 值
            //     y: 200, // Number，可选，节点位置的 y 值
            // },
            {
                id: 'node1',
                type: 'rect-note', // 使用自定义的节点名称
                content: '11123123'
              },
              {
                id: 'node2',
                type: 'rect-note', // 使用自定义的节点名称
                content: '111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123111231231112312311123123'
              },
        ],
        // 边集
        edges: [
            {
                source: 'node1', // String，必须，起始点 id
                target: 'node2', // String，必须，目标点 id
            },
        ],
    }
}